const RegExp = {  //常用正则表达式
  num: /^\+?[1-9][0-9]*$/,  //大于0的整数
  numZ: /^\+?[0-9][0-9]*$/, //正整数(包含0)
  numZ2: /^-?[0-9][0-9]*$/, //整数(包含0、负数)
  numF: /^-?([0-9][0-9]*)(\.\d{1,2})?$/, //数字(包含负数、0,最多两位小数)
  numF2: /^([0-9][0-9]*)(\.\d{1,2})?$/, //数字(不含负数,最多两位小数)
  numD: /^-?([0-9][0-9]*)(\.\d{1,10})?$/, //数字(包含负数、0,最多10位小数)
  numD2: /^(([0-9]+[\.]?[0-9]+)|[1-9])$/, //数字(不含负数和0,无限位小数)
  numD3: /^(([0-9]+[\.]?[0-9]+)|[0-9])$/, //数字(不含负数,无限位小数)
  num0_100: /^(?:0|[1-9][0-9]?|100)$/,  //0-100内整数
  num0_1: /^[01]$|^0\.\d{1,2}$|^1\.0{1,2}$/,  //0-1之间小数(最多两位),包含0、1
  post: /^\d{6}$/, //邮编
  phone: /^(((\()?\d{2,4}(\))?[-(\s)*]){0,2})?(\d{7,8})$/, //固定电话(区号部分为2-4位数字,外面可以加括号,后面可以加斜杠或空格,可重复1-2次;电话号码部分为7-8位)
  mobile: /^[1][3,5,8][0-9]{9}$/, //手机号
  email: /^[0-9a-zA-Z]([-.\w]*[0-9a-zA-Z])*@(([0-9a-zA-Z])+([-\w]*[0-9a-zA-Z])*\.)+[a-zA-Z]{2,9}$/, //Email(@前面不能以点为结尾)
  date: /^\d{4}-\d{2}-\d{2}$/,  //日期是否yyyy-MM-dd格式
  time: /^\d{2}:\d{2}:\d{2}$/,  //时间是否hh:mm:ss格式
  datetime: /^\d{4}-\d{2}-\d{2} \d{2}:\d{2}:\d{2}$/,  //日期时间是否yyyy-MM-dd hh:mm:ss格式
  datetimeO: /^\d{4}-\d{2}-\d{2}( \d{2}:\d{2}:\d{2})?$/,  //是否date或datetime格式
  pass: /^[0-9a-zA-Z]{6,16}$/,  //密码格式是否由字母和数字组成,长度为6-16位
  user: /^[a-zA-Z][a-zA-Z0-9_\u4E00-\u9FA5]{3,15}$/,  //用户名格式是否由字母、数字、中文和下划线组成,以字母开头,长度为4-16位
  ip: /^((25[0-5])|(2[0-4]\d)|(1\d\d)|([1-9]\d)|\d)(\.((25[0-5])|(2[0-4]\d)|(1\d\d)|([1-9]\d)|\d)){3}(:(6553[0-5]|655[0-2]\d|65[0-4]\d{2}|6[0-4]\d{3}|[1-5]\d{4}|[1-9]\d{0,3}))?$/, //IP格式为xxx.xxx.xxx.xxx或xxx.xxx.xxx.xxx:端口号,xxx的值必须是0-255,端口号的值必须是1-65535
  cardId: /^(\d{18,18}|\d{15,15}|\d{17,17}x)$/i,   //身份证
  enFirst: /^[a-zA-Z][\s\S]*$/,  //英文开头
  chFirst: /^[\u4E00-\u9FA5][\s\S]*$/,  //中文开头
  percent: /^\+?(([1-9]\d?)|(100)|(0))\%$/  //百分数(0%-100%)
};

export {
  RegExp
};